# DataFrames

In [3]:
import pandas as pd
import numpy as np

In [5]:
#np.random.seed(101)

In [20]:
df = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122
E  1.512818 -0.161191  1.143736  0.552912

In [11]:
df['X']

A    0.464053
B   -0.109865
C   -0.785819
D   -0.464756
E    0.344550
Name: X, dtype: float64

In [12]:
df.to_dict()

{'W': {'A': 0.5069415295191032,
  'B': 1.6444448976283625,
  'C': -1.1060759501974815,
  'D': 0.08024944120088152,
  'E': 1.1924322454357958},
 'X': {'A': 0.46405338343598035,
  'B': -0.10986495590822566,
  'C': -0.7858194186687233,
  'D': -0.4647562250281954,
  'E': 0.34455016243904296},
 'Y': {'A': -1.4806225746880377,
  'B': -0.011677657967237222,
  'C': -1.5373910645306732,
  'D': -0.0006279666042221691,
  'E': -0.16834054891700045},
 'Z': {'A': -0.45827869375304137,
  'B': 0.4249101905003906,
  'C': -0.06417232917674379,
  'D': 0.5085249564089767,
  'E': 0.9267019031530495}}

In [17]:
lst1 = [1,2,3]
lst2 = [10,20,30]

d = {"col1":lst1,"col2":lst2}
d

{'col1': [1, 2, 3], 'col2': [10, 20, 30]}

In [18]:
df = pd.DataFrame(d)
df

   col1  col2
0     1    10
1     2    20
2     3    30

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [21]:
df['W'] # ===>>  SELECT W FROM df

A   -0.150193
B    0.433880
C    0.722193
D    0.600316
E    1.512818
Name: W, dtype: float64

In [22]:
# Pass a list of column names
df[['W','Z']] # ===>> SELECT W, Z FROM df

          W         Z
A -0.150193 -0.111924
B  0.433880  2.182804
C  0.722193 -0.947742
D  0.600316  1.168122
E  1.512818  0.552912

In [23]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -0.150193
B    0.433880
C    0.722193
D    0.600316
E    1.512818
Name: W, dtype: float64

DataFrame Columns are just Series

In [24]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [25]:
df['New_Col'] = (df['W'] + df['X']) * (df['Y'] + df['Z'])
df

          W         X         Y         Z   New_Col
A -0.150193  0.130853  0.623340 -0.111924 -0.009891
B  0.433880 -1.646838  1.308017  2.182804 -4.234221
C  0.722193  1.744769 -1.690217 -0.947742 -6.507745
D  0.600316  1.118037  0.071547  1.168122  2.130187
E  1.512818 -0.161191  1.143736  0.552912  2.293234

** Removing Columns**

In [26]:
df['New_Col']

A   -0.009891
B   -4.234221
C   -6.507745
D    2.130187
E    2.293234
Name: New_Col, dtype: float64

In [28]:
df.drop(['New_Col'],axis=1)

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122
E  1.512818 -0.161191  1.143736  0.552912

In [29]:
# Not inplace unless specified!
df

          W         X         Y         Z   New_Col
A -0.150193  0.130853  0.623340 -0.111924 -0.009891
B  0.433880 -1.646838  1.308017  2.182804 -4.234221
C  0.722193  1.744769 -1.690217 -0.947742 -6.507745
D  0.600316  1.118037  0.071547  1.168122  2.130187
E  1.512818 -0.161191  1.143736  0.552912  2.293234

In [30]:
df2 = df.drop('New_Col',axis=1)

In [31]:
df2

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122
E  1.512818 -0.161191  1.143736  0.552912

In [32]:
df

          W         X         Y         Z   New_Col
A -0.150193  0.130853  0.623340 -0.111924 -0.009891
B  0.433880 -1.646838  1.308017  2.182804 -4.234221
C  0.722193  1.744769 -1.690217 -0.947742 -6.507745
D  0.600316  1.118037  0.071547  1.168122  2.130187
E  1.512818 -0.161191  1.143736  0.552912  2.293234

In [33]:
df.drop('New_Col',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122
E  1.512818 -0.161191  1.143736  0.552912

Can also drop rows this way:

In [35]:
df.drop('E',inplace=True)
df

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122

** Selecting Rows**

In [36]:
df['W']

A   -0.150193
B    0.433880
C    0.722193
D    0.600316
Name: W, dtype: float64

In [37]:
df.loc['A']

W   -0.150193
X    0.130853
Y    0.623340
Z   -0.111924
Name: A, dtype: float64

Or select based off of position instead of label

In [38]:
df.iloc[0]

W   -0.150193
X    0.130853
Y    0.623340
Z   -0.111924
Name: A, dtype: float64

** Selecting subset of rows and columns **

In [39]:
df.loc['B','Y'] # ===>> Select Y from df where B

1.3080172717389968

In [40]:
df.loc[['A','C','D'],['Y','Z']]

          Y         Z
A  0.623340 -0.111924
C -1.690217 -0.947742
D  0.071547  1.168122

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [41]:
df

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122

In [42]:
df>0

       W      X      Y      Z
A  False   True   True  False
B   True  False   True   True
C   True   True  False  False
D   True   True   True   True

In [43]:
df[df>0] # ==> Select * FROM df WHERE df_val > 0

          W         X         Y         Z
A       NaN  0.130853  0.623340       NaN
B  0.433880       NaN  1.308017  2.182804
C  0.722193  1.744769       NaN       NaN
D  0.600316  1.118037  0.071547  1.168122

In [44]:
df['Y']>0

A     True
B     True
C    False
D     True
Name: Y, dtype: bool

In [46]:
df[df['Y']>0][['W','X','Z']] # ==>> SELECT W,X,Z FROM df WHERE Y > 0

          W         X         Z
A -0.150193  0.130853 -0.111924
B  0.433880 -1.646838  2.182804
D  0.600316  1.118037  1.168122

In [47]:
df[df['X']>0]['Y']

A    0.623340
C   -1.690217
D    0.071547
Name: Y, dtype: float64

In [48]:
df[df['X']>0][['Y','X']]

          Y         X
A  0.623340  0.130853
C -1.690217  1.744769
D  0.071547  1.118037

For two conditions you can use | and & and ~ with parenthesis:

In [51]:
df[(df['Z']>0) | (df['Y'] < 0)]

          W         X         Y         Z
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [52]:
df

          W         X         Y         Z
A -0.150193  0.130853  0.623340 -0.111924
B  0.433880 -1.646838  1.308017  2.182804
C  0.722193  1.744769 -1.690217 -0.947742
D  0.600316  1.118037  0.071547  1.168122

In [53]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.150193  0.130853  0.623340 -0.111924
1     B  0.433880 -1.646838  1.308017  2.182804
2     C  0.722193  1.744769 -1.690217 -0.947742
3     D  0.600316  1.118037  0.071547  1.168122

In [54]:
newind = ['CA','NY','WY','OR']

In [55]:
df['States'] = newind

In [56]:
df

          W         X         Y         Z States
A -0.150193  0.130853  0.623340 -0.111924     CA
B  0.433880 -1.646838  1.308017  2.182804     NY
C  0.722193  1.744769 -1.690217 -0.947742     WY
D  0.600316  1.118037  0.071547  1.168122     OR

In [57]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.150193  0.130853  0.623340 -0.111924
NY      0.433880 -1.646838  1.308017  2.182804
WY      0.722193  1.744769 -1.690217 -0.947742
OR      0.600316  1.118037  0.071547  1.168122

In [58]:
df

          W         X         Y         Z States
A -0.150193  0.130853  0.623340 -0.111924     CA
B  0.433880 -1.646838  1.308017  2.182804     NY
C  0.722193  1.744769 -1.690217 -0.947742     WY
D  0.600316  1.118037  0.071547  1.168122     OR

In [59]:
df.set_index('States',inplace=True)

In [60]:
df

               W         X         Y         Z
States
CA     -0.150193  0.130853  0.623340 -0.111924
NY      0.433880 -1.646838  1.308017  2.182804
WY      0.722193  1.744769 -1.690217 -0.947742
OR      0.600316  1.118037  0.071547  1.168122

In [61]:
df.index

Index(['CA', 'NY', 'WY', 'OR'], dtype='object', name='States')